runs/twoInletMixingPrecipitation/constant/inputParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      inputParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

useTwoSpecies       yes;

molW                100.0;

diffInLiquid        5e-8;
diffCationInLiquid  5e-8;
diffAnionInLiquid   5e-8;

nuCation            1.0;
nuAnion             1.0;

// ************************************************************************* //
