runs/twoInletMixingPrecipitation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (liquid solid);

liquid
{
    type            pureMovingPhaseModel;
}

solid
{
    type            pureStaticSolidPhaseModel;
}

interfacePorous
(
    (solid and liquid)
    {
        type            VollerPrakash;
        solidPhase      alpha.solid;
        Cu              1e12;
    }
);

massTransferModel
(
    (liquid to solid)
    {
        type                mixingPrecipitation;
        kPrec               5e-6;
        Tactivate           300;
        nPrec               1.0;
        Ksp                 4.0;
        Mv                  100.0;
        cationField         Ccation;
        anionField          Canion;
        alphaSolidMin       0.9;
        reactiveWallPatches (walls);
        writeSaturationFields true;
    }
);

// ************************************************************************* //
