runs/twoInletMixingPrecipitation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1912                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inletAnion
    {
        type            patch;
        nFaces          24;
        startFace       22752;
    }
    inletCation
    {
        type            patch;
        nFaces          24;
        startFace       22776;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       22800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          480;
        startFace       22848;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23040;
        startFace       23328;
    }
)

// ************************************************************************* //
