runs/twoInletMixingPrecipitation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 0)
    (40 0 0)
    (40 1 0)
    (0 1 0)
    (0 0 4)
    (40 0 4)
    (40 1 4)
    (0 1 4)
    (0 0 8)
    (40 0 8)
    (40 1 8)
    (0 1 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)     (240 1 24) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11)   (240 1 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletAnion
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    inletCation
    {
        type patch;
        faces
        (
            (4 8 11 7)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
            (6 10 9 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (8 9 10 11)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (5 9 8 4)
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
