runs/twoInletMixingPrecipitation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mpFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         2;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxDeltaT       0.01;
maxCo           0.5;
maxAlphaCo      0.5;
maxAlphaDdt     1.0;
maxDi           5.0;

// ************************************************************************* //
