runs/twoInletMixingPrecipitation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.solid     0
    volScalarFieldValue alpha.liquid    1
    volScalarFieldValue Ccation         0
    volScalarFieldValue Canion          0
);

regions
(
    boxToCell
    {
        box (0.002 -0.0005 0.0036) (0.003 0.0015 0.0044);
        fieldValues
        (
            volScalarFieldValue alpha.solid     1
            volScalarFieldValue alpha.liquid    0
            volScalarFieldValue Ccation         0
            volScalarFieldValue Canion          0
        );
    }
);

// ************************************************************************* //
